In [1]:
# Data Pre-processing

# Importing libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
# Importing dataset
dataset = pd.read_csv('2.2 Data.csv.csv')
dataset

        State        Age       Salary Purchased
0  California  42.000000  60000.00000        No
1     Florida  29.000000  55000.00000       Yes
2       Texas  27.000000  72000.00000        No
3     Florida  26.000000  48000.00000        No
4       Texas  39.000000  65111.11111       Yes
5  California  34.000000  54000.00000       Yes
6     Florida  36.888889  57000.00000        No
7  California  46.000000  80000.00000       Yes
8       Texas  51.000000  85000.00000        No
9  California  38.000000  75000.00000       Yes

In [3]:
X = dataset.iloc[:,:-1].values
X

array([['California', 42.0, 60000.0],
       ['Florida', 29.0, 55000.0],
       ['Texas', 27.0, 72000.0],
       ['Florida', 26.0, 48000.0],
       ['Texas', 39.0, 65111.111110000005],
       ['California', 34.0, 54000.0],
       ['Florida', 36.88888889, 57000.0],
       ['California', 46.0, 80000.0],
       ['Texas', 51.0, 85000.0],
       ['California', 38.0, 75000.0]], dtype=object)

In [4]:
Y = dataset.iloc[:,3].values
Y

array(['No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes'],
      dtype=object)

In [5]:
dataset.describe()

             Age        Salary
count  10.000000     10.000000
mean   36.888889  65111.111111
std     8.171012  12350.838428
min    26.000000  48000.000000
25%    30.250000  55500.000000
50%    37.444444  62555.555555
75%    41.250000  74250.000000
max    51.000000  85000.000000

In [7]:
# Working with missing data
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(missing_values=np.nan,strategy='mean')
imputer = imputer.fit(X[:, 1:3])
X[:, 1:3] = imputer.transform(X[:, 1:3])